# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv8-seg instance segmentation model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolov8
# Task docs: https://docs.ultralytics.com/tasks/segment

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-seg.yaml' will call yolov8-seg.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

depth_multiple: 0.33
width_multiple: 0.25
# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, My_HGStem, [3,64]] # 0-P1/2
  - [-1, 1, Ghost_HGBlock, [64, 128]] # 1-P2/4
  - [-1, 1, DWConv, [128, 128, 3, 2, 1]]
  - [-1, 1, Ghost_HGBlock, [128, 256]] # 3-P3/8
  - [-1, 1, DWConv, [256, 256, 3, 2, 1]]
  - [-1, 1, Ghost_HGBlock, [256, 512]]# 5-P4/16
  - [-1, 1, Ghost_HGBlock, [512, 512]]
  - [-1, 1, Ghost_HGBlock, [512, 512]] #7
  - [-1, 1, DWConv, [512, 512, 3, 2, 1]]
  - [-1, 1, Ghost_HGBlock, [512, 1024]] # 9-P5/32
  - [-1, 1, SPPF, [1024, 5]] # 10

head:
  # [from, repeats, module, args]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 7], 1, Concat, [1]] # 12
  - [-1, 1, C2f_Faster, [1024, 512]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #14
  - [[-1, 3], 1, Concat, [1]]
  - [-1, 1, C2f_Faster, [512, 256]]#16

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] #18
  - [-1, 1, C2f_Faster, [768, 512]]

  - [ -1, 1, Conv, [ 512, 3, 2 ] ] #20
  - [[ -1, 10 ], 1, Concat, [ 1 ] ]
  - [-1, 1, C2f_Faster, [ 1024, 512]] #22

# YOLOv8.0n head
  - [[16, 19, 22], 1, Segment, [nc, 32, 256]] # Segment(P3, P4, P5)